#6. Реализовать два небольших скрипта:
#а) итератор, генерирующий целые числа, начиная с указанного,
#б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#Подсказка: использовать функцию count() и cycle() модуля itertools.
#Обратите внимание, что создаваемый цикл не должен быть бесконечным.
#Необходимо предусмотреть условие его завершения.
#Например, в первом задании выводим целые числа, начиная с 3,
#а при достижении числа 10 завершаем цикл.
#Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

#В командной строке
#C:\Users\zikon>cd Desktop\PP4
#python gen_scrypt1.py 10 30
#C:\Users\zikon\Desktop\PP4>python gen_scrypt1.py 10 15
#10
#11
#12
#13
#14
#15


#C:\Users\zikon\Desktop\PP4>python gen_script2.py 4
#4
#2
#5
#17
#11